Revit 2027 API
BuiltInFailures.AutoJoinFailures Class
 Failures about AutoJoin.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.AutoJoinFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class AutoJoinFailures
Public NotInheritable Class AutoJoinFailures
public ref class AutoJoinFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type AutoJoinFailures = class end
The BuiltInFailures.AutoJoinFailures type exposes the following members.
Properties
Name | Description
DesignOptionAndWorksetViolation |  Can't make the expected join because of editability and design option restrictions.
DesignOptionCannotReference |  Design Option ' [Name] ' cannot reference Design Option ' [Name] '.
OtherNonEditJoinFailure |  Two elements were not automatically joined because other elements at join are not editable.
UnexpectedJoinFailure |  Join failure caused by editability or design option related problem.
Unknown |  Unknown
WorksetJoinWarn |  Two elements were not automatically joined because one or both is not editable.
Top
See Also
Reference
Autodesk.Revit.DB Namespace